#include <iostream>
#include <cassert>
#include <stack>

/*
    ВНИМАНИЕ! Для решения данной задачи нужно использовать структуру данных стек!
    
Пара слов называется стековой анаграмой, если одно слово можно получить из другого,
проведя последовательность стековых операций с его буквами (взять очередную букву исходного
слова и поместить ее в стек; взять букву из стека и добавить ее в конец выходного слова).
Для заданной пары слов требуется определить, можно ли выполнить последовательность стековых
операций, переводящую первое слово во второе. Все буквы в слове различные. Длина анаграммы ≤ 10000.
*/

int main() {


    return 0;
}